Revit 2026 API

# ViewCropRegionShapeManagerSplit Property

---

Whether or not the view crop is split.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Split { get; }
```
```vb
Public ReadOnly Property Split As Boolean
	Get
```
```cpp
public:
property bool Split {
	bool get ();
}
```
```fsharp
member Split : bool with get
```

#### Property Value

Boolean

This property reflects the actual visual split of the crop region. Thus, if the view has non-rectangular crop shape set, this property is false.

#### Reference

ViewCropRegionShapeManager Class

Autodesk.Revit.DB Namespace